Returns true if getNumberOfBarGeometry() is less than GetNumberOfBars(), false otherwise.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
 Syntax
  C#
public bool CanAddBarGeometry()
  Visual Basic
Public Function CanAddBarGeometry As Boolean
  Visual C++
public:
bool CanAddBarGeometry()
 See Also
  RebarTrimExtendData Class
  Autodesk.Revit.DB.Structure Namespace